opennumberroll.wsdl_INSTALL

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://oss.dbc.dk/ns/opennumberroll" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" name="OpennumberrollService" targetNamespace="http://oss.dbc.dk/ns/opennumberroll">
  <wsdl:types>
    <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified">
      <xs:import namespace="http://oss.dbc.dk/ns/opennumberroll" schemaLocation="opennumberroll.xsd"/>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="NumberRollInputMessage">
    <wsdl:part name="parameters" element="tns:numberRollRequest"/>
  </wsdl:message>
  <wsdl:message name="NumberRollOutputMessage">
    <wsdl:part name="parameters" element="tns:numberRollResponse"/>
  </wsdl:message>
  <wsdl:portType name="OpennumberrollPortType">
    <wsdl:operation name="numberRoll">
      <wsdl:input wsaw:Action="http://oss.dbc.dk/ns/opennumberroll/NumberRoll" message="tns:NumberRollInputMessage"/>
      <wsdl:output wsaw:Action="http://oss.dbc.dk/ns/opennumberroll/NumberRollResponse" message="tns:NumberRollOutputMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="OpennumberrollBinding" type="tns:OpennumberrollPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="numberRoll">
      <soap:operation soapAction="http://oss.dbc.dk/ns/opennumberroll/NumberRoll" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="OpennumberrollService">
    <wsdl:port name="OpennumberrollPort" binding="tns:OpennumberrollBinding">
      <soap:address location="http://opennumberroll.addi.dk/1.0/"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
