xml/request/openNumberRollRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/opennumberroll">
   <soapenv:Header/>
   <soapenv:Body>
      <open:numberRollRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <open:numberRollName>?</open:numberRollName>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:trackingId>?</open:trackingId>
      </open:numberRollRequest>
   </soapenv:Body>
</soapenv:Envelope>
